{
    "common": [
        {
            "xpath": "inject",
            "name": "Inject",
            "file": "20-inject",
            "description": "Explore the Node-RED Inject node: learn how to use it, understand its use cases, and discover various examples.",
            "keywords": "node-red inject node, repeat messages, specific time, inject node use case, inject node example flow"
        },
        {
            "xpath": "debug",
            "name": "Debug",
            "file": "21-debug",
            "description": "Learn how to effectively use the Node-RED Debug node for debugging: configure output options, gain insights into flow data, and explore practical examples",
            "keywords": "node-red debug node, debugging, printing messages to debug sidebar, debug node use case, debug node example flow"
        },
        {
            "xpath": "complete",
            "name": "Complete",
            "file": "24-complete",
            "description": "Learn about the Node-RED Complete Node: trigger flows upon task completion, handle asynchronous operations, and explore practical examples for streamlined process automation.",
            "keywords": "node-red complete node, asynchronous operations, complete node use case, complete node example flow"
        },
        {
            "xpath": "catch",
            "name": "Catch",
            "file": "25-catch",
            "description": "Explore the Node-RED Catch node: manage errors, handle asynchronous operations, and see real-world use-cases and practical examples for effective error handling in your flows.",
            "keywords": "node-red catch node, error handling, catch node use case, catch node example flow"
        },
        {
            "xpath": "status",
            "name": "Status",
            "file": "25-status",
            "description": "Explore the Node-RED Status node: Monitor and react to the operational status of individual nodes or entire flows in real-time and explore practical example flows.",
            "keywords": "node-red status node, monitoring flow status, status node use case, status node example flow"
        },
        {
            "xpath": "link",
            "name": "Link",
            "file": "60-link",
            "description": "Explore how to connect and exchange data between different flows in Node-RED using the Link In and Link Out nodes, enhancing flow organization and data handling.",
            "keywords": "node-red link nodes, link in and link out nodes, exchange data between flows, link node use case, link node example flow"
        },
        {
            "xpath": "comment",
            "name": "Comment",
            "file": "90-comment",
            "description": "Explore how to enhance flow readability, improve maintenance, and simplify debugging in Node-RED with the Comment node, using detailed inline comments and explanations.",
            "keywords": "node-red comment nodes, flow documentation, inline comments, flow readability, comment node use case, comment node example flow"
        },
        {
            "xpath": "unknown",
            "name": "Unknown",
            "file": "98-unknown",
            "description": "Learn about the Node-RED 'unknown' node and how it is displayed when importing flows with nodes that have not been installed yet.",
            "keywords": "node-red unknown node, showing unknown, node not installed, unknown node use case, unknown node example flow"
        }
    ],
    "function": [
        {
            "xpath": "function",
            "name": "Function",
            "file": "10-function",
            "description": "Learn how to use Node-RED Function node: Write JavaScript to process messages, handle tasks, and customize flows. Explore different use cases with practical examples.",
            "keywords": "node-red function node, writing custom javascript, flow customization, function node use case, function node example flow"
        },
        {
            "xpath": "switch",
            "name": "Switch",
            "file": "10-switch",
            "description": "Learn how to use the Switch node in Node-RED to direct messages based on specific conditions, like filtering messages, routing them conditionally, and processing different types of events.",
            "keywords": "node-red switch node, conditional routing, switch node use case, switch node example flow"
        },
        {
            "xpath": "change",
            "name": "Change",
            "file": "15-change",
            "description": "Learn how the Node-RED Change node simplifies data manipulation in your flows. Explore practical examples for filtering, enriching, renaming, and formatting messages effortlessly.",
            "keywords": "node-red change node, message transformation, data manipulation, message filtering, rename properties, message formatting, change node use case, change node example flow"
        },
        {
            "xpath": "range",
            "name": "Range",
            "file": "16-range",
            "description": "Learn how the Node-RED Range node scales, normalizes, and converts numeric values across different ranges, with practical examples.",
            "keywords": "node-red range node, numeric value mapping, data scaling, analog-to-digital conversion, range node use case, range node example flow"
        },
        {
            "xpath": "template",
            "name": "Template",
            "file": "80-template",
            "description": "Learn how to use the Node-RED Template node: Learn to create dynamic text templates with Mustache syntax, populate data, configure output formats, and generate HTML or JSON effortlessly",
            "keywords": "node-red template node, mustache template, html template, text template, dynamic content, template node use case, template node example flow"
        },
        {
            "xpath": "delay",
            "name": "Delay",
            "file": "89-delay",
            "description": "Learn How to use the Node-RED Delay node to control message timing, rate limit requests, ensure order, and simulate real-world conditions.",
            "keywords": "node-red delay node, message timing control, rate limiting, message batching, sequential message processing, delay node use case, delay node example flow"
        },
        {
            "xpath": "trigger",
            "name": "Trigger",
            "file": "89-trigger",
            "description": "Learn how to use the Trigger node in Node-RED to initiate and repeat messages at precise intervals, automate tasks, manage timeouts, and conserve resources efficiently.",
            "keywords": "node-red trigger node, message scheduling, message recurrence, message triggering, trigger node use case, trigger node example flow"
        },
        {
            "xpath": "exec",
            "name": "Exec",
            "file": "90-exec",
            "description": "Learn to use the exec node in Node-RED for executing command-line commands and managing output. Explore its features, limitations, and why it's disabled on FlowFuse Cloud.",
            "keywords": "node-red exec node, command line, node-red exec node output, node-red exec node disabled, exec node use case, exec node example flow"
        },
        {
            "xpath": "rbe",
            "name": "Filter",
            "file": "rbe",
            "description": "Learn how to utilize the Filter node in Node-RED to manage data transmission efficiently. Explore deadband and narrowband modes for filtering changes and values with practical examples.",
            "keywords": "node-red, filter node, deadband mode, narrowband mode, report by exception, rbe node, optimize data transmission, rbe node use case, rbe node example flow"
        }
    ],
    "network": [
        {
            "xpath": "tls",
            "name": "TLS",
            "file": "05-tls",
            "description": "Learn to configure TLS for secure communication in Node-RED using the TLS Config node with HTTP, TCP, and custom network nodes. Ensure encrypted data transmission and secure connections.",
            "keywords": "tls config node, node-red tls configuration, secure communication, encrypted communication, tls node use case, tls node example flow"
        },
        {
            "xpath": "http proxy",
            "name": "HTTP Proxy",
            "file": "06-httpproxy",
            "description": "Learn how to set up an http proxy in node-red to route outgoing requests through a proxy server.",
            "keywords": "node-red http proxy, proxy configuration, routing http requests, http proxy server, http proxy node use case, http proxy node example flow"
        },
        {
            "xpath": "mqtt broker",
            "name": "MQTT broker",
            "file": "06-httpbroker",
            "description": "Learn how to configure MQTT broker settings in Node-RED using the MQTT Broker Config node for MQTT In and Out nodes.",
            "keywords": "node-red http proxy, proxy configuration, routing http requests, http proxy server, mqtt broker node use case, mqtt broker node example flow"
        },
        {
            "xpath": "mqtt in",
            "name": "MQTT in",
            "file": "10-mqttin",
            "description": "Learn how to configure and use MQTT-in nodes in Node-RED for subscribing to topic patterns on MQTT brokers. Explore practical examples and setup guides to efficiently handle MQTT messages.",
            "keywords": "node-red mqtt-in node, node-red mqtt, subscribing to mqtt topic, mqtt message handling, data streaming, mqtt in node use case, mqtt in node example flow"
        },
        {
            "xpath": "mqtt out",
            "name": "MQTT out",
            "file": "10-mqttout",
            "description": "Learn how to use MQTT out nodes in Node-RED for publishing messages over an MQTT broker. Explore practical examples and setup guides for efficient communication.",
            "keywords": "node-red mqtt-out node, node-red mqtt, publishing messages, data streaming, mqtt out usecase, mqtt out example flow"
        },
        {
            "xpath": "http in",
            "name": "HTTP in",
            "file": "21-httpin",
            "description": "Learn how to use HTTP In nodes in Node-RED: Create HTTP endpoints, trigger flows with GET, POST, PUT, and DELETE methods, and send different types of data as responses.",
            "keywords": "node-red http-in node, http server, get request, creating api, http in usecase, http in example flow"
        },
        {
            "xpath": "http request",
            "name": "HTTP request",
            "file": "21-httprequest",
            "description": "Learn how to use HTTP Request nodes in Node-RED to make various HTTP requests (GET, POST, PUT, DELETE, PATCH) to external servers or services, manage JSON data, and integrate with APIs efficiently.",
            "keywords": "node-red http-request node, handle http requests, get request, post request, put request, delete request, patch request, http request usecase, http request example flow"
        },
        {
            "xpath": "http response",
            "name": "HTTP response",
            "file": "21-httpresponse",
            "description": "Learn how to use the HTTP Response node in Node-RED to send customized HTTP responses, set status codes, headers, and manage cookies, for enabling dynamic interaction with client requests.",
            "keywords": "node-red http response node, setting cookies, sending response back, status codes, http response usecase, http response example flow"
        },
        {
            "xpath": "websocket",
            "name": "WebSocket",
            "file": "22-websocket",
            "description": "Learn how to use the WebSocket node in Node-RED to enable bidirectional communication between clients and servers over a single, long-lived connection.",
            "keywords": "node-red websocket node, websocket communication, bidirectional communication, real-time data exchange, websocket usecase, websocket example flow"
        },
        {
            "xpath": "tcp in",
            "name": "TCP in",
            "file": "31-tcpin",
            "description": "Learn how to use Node-RED's TCP nodes to facilitate TCP/IP communication for various applications. Configure client and server modes, integrate IoT devices, and streamline workflows effortlessly.",
            "keywords": "node-red tcp-in nodes, tcp/ip communication, tcp client, tcp servers, tcp in usecase, tcp in example flow"
        },
        {
            "xpath": "tcp out",
            "name": "TCP out",
            "file": "32-tcpout",
            "description": "Learn how to utilize TCP-Out nodes in Node-RED for efficient TCP/IP communication. Connect to remote ports, reply to messages, and ensure secure data transmission.",
            "keywords": "node-red tcp-out node, tcp communication, tcp client, tcp servers, tcp out usecase, tcp out example flow"
        },
        {
            "xpath": "upd in",
            "name": "UDP in",
            "file": "33-udpin",
            "description": "Learn how to use the UDP-In node in Node-RED for receiving UDP messages from remote devices or services.",
            "keywords": "node-red udp-in node, receive udp messages, real-time data reception, udp in usecase, udp in example flow"
        },
        {
            "xpath": "upd out",
            "name": "UDP out",
            "file": "33-udpout",
            "description": "Learn how to send UDP messages using the udp-out node in Node-RED for real-time data transmission",
            "keywords": "node-red udp-out node, real-time data transmission, udp out usecase, udp out example flow"
        }
    ],
    "parsers": [
        {
            "xpath": "csv",
            "name": "CSV",
            "file": "70-csv",
            "description": "Learn how to process CSV data in Node-RED using the CSV node. Convert CSV strings to JavaScript objects or vice versa",
            "keywords": "node-red csv node, convert csv to json, parse csv, tabular data handling, csv usecase, csv example flow"
        },
        {
            "xpath": "html",
            "name": "HTML",
            "file": "70-html",
            "description": "Learn how to parse HTML content using the HTML node in Node-RED. Extract specific HTML elements like h1 tags from web pages.",
            "keywords": "node-red html node, parse html, html parsing, html parsing example, html usecase, html example flow"
        },
        {
            "xpath": "json",
            "name": "JSON",
            "file": "70-json",
            "description": "Learn how to use the JSON node in Node-RED for manipulating data between JSON format and JavaScript objects, essential for API interactions and data storage.",
            "keywords": "node-red json node, json manipulation, json to object, object to json, json formatting, json usecase, json example flow"
        },
        {
            "xpath": "xml",
            "name": "XML",
            "file": "70-xml",
            "description": "Learn how to use the XML node in Node-RED for parsing XML data to JSON and converting JSON to XML.",
            "keywords": "node-red xml node, parse xml to json, convert json to xml, xml usecase, xml example flow"
        },
        {
            "xpath": "yaml",
            "name": "YAML",
            "file": "70-yaml",
            "description": "Learn how to use the YAML node in Node-RED for parsing and generating YAML data. Convert YAML to JSON and vice versa.",
            "keywords": "node-red yaml node, yaml to json, json to yaml, yaml file handling, yaml usecase, yaml example flow"
        }
    ],
    "sequence": [
        {
            "xpath": "split",
            "name": "Split",
            "file": "17-split",
            "description": "Learn how to use the Split node in Node-RED to divide messages into multiple parts based on specific rules. Split strings, arrays, and objects to handle data effectively in your workflows.",
            "keywords": "node-red split node, divide messages, split strings, split arrays, split objects, message splitting, message processing, split usecase, split example flow"
        },
        {
            "xpath": "sort",
            "name": "Sort",
            "file": "18-sort",
            "description": "Learn how to use the Sort node in Node-RED to organize data efficiently. Sort messages or sequences in ascending or descending order for better processing.",
            "keywords": "node-red sort node, message sorting, data processing, message sequences, ascending order, descending order, sort usecase, sort example flow"
        },
        {
            "xpath": "batch",
            "name": "Batch",
            "file": "19-batch",
            "description": "Learn how to use the Batch node in Node-RED to group sequences of messages into batches based on number or time interval.",
            "keywords": "node-red batch node, batch processing, data processing, batch usecase, batch example flow"
        },
        {
            "xpath": "join",
            "name": "Join",
            "file": "17-join",
            "description": "Learn how to use the Join node in Node-RED for merging multiple messages into one. Explore its practical examples and use cases for data aggregation and processing.",
            "keywords": "node-red join node, data aggregation, message processing, join usecase, join example flow"
        }
    ],
    "storage": [
        {
            "xpath": "file write",
            "name": "File write",
            "file": "10-filewrite",
            "description": "Learn how to use the Write File Node in Node-RED for efficient data logging and management. ",
            "keywords": "node-red write file node, data logging, writing data to file, deleting file, file write usecase, file write example flow"
        },
        {
            "xpath": "file read",
            "name": "File read",
            "file": "fileread",
            "description": "Learn how to use the read file node in node-red to read file contents from the file system.",
            "keywords": "node-red mqtt config node, configuring mqtt nodes, file read usecase, file read example flow"
        }
    ]
}
