  [{
    "title": "Simplified Hosting and Maintenance",
    "imageFolder": "./images/pictograms/",
    "imageFile": "cloud_nr_blue.png",
    "imageAlt": " Node-RED hosted in the cloud.",
    "content": "Experience ease of use with <a href='/product/cloud/'>FlowFuse Cloud</a>, handling all your hosting needs. Forget the complexities of maintaining your development environment; we've got it covered."
  },
  {
    "title": "Centralised Instance Management",
    "imageFolder": "./images/pictograms/",
    "imageFile": "instance_blue.png",
    "imageAlt": " three Node-REd instances grouped in a single place.",
    "content": "FlowFuse enables seamless management of multiple instances from a single platform, streamlining your development and coordination efforts."
  },
  {
    "title": "Scalable High Availability",
    "imageFolder": "./images/pictograms/",
    "imageFile": "scalable_pictogram_blue.png",
    "imageAlt": " scalability.",
    "content": "Node-RED applications can be run in <a href='/blog/2023/05/bringing-high-availability-to-node-red/'>High Availability</a> mode to allow the applications to scale up to meet spikes in demand. Even with instance failures, we ensure continuous operations by automatically switching to another Node-RED instance."
  },
  {
    "title": "Data Sharing and Storage",
    "imageFolder": "./images/pictograms/",
    "imageFile": "connect_device_blue.png",
    "imageAlt": " data sharing and storage",
    "content": "FlowFuse adds to a Node-RED environment the ability to share information between instances and persistent data. <a href='/docs/user/projectnodes/#flowfuse-project-nodes'>FlowFuse Project Nodes</a> facilitate data and message exchange between Node-RED projects, ideal for edge-to-cloud communication."
  },{
    "title": "Remote Device Management at the Edge",
    "imageFolder": "./images/pictograms/",
    "imageFile": "edge_blue.png",
    "imageAlt": " edge management.",
    "content": "FlowFuse allows you to deploy and manage Node-RED instances out to <a href='/solutions/device-management/'>edge devices</a>. This allows you to deploy the exact same instance out to hundreds or thousands of edge devices and monitor their status."
  },{
    "title": "Software Delivery Pipelines",
    "imageFolder": "./images/pictograms/",
    "imageFile": "pipeline_blue.png",
    "imageAlt": " a DevOps pipeline.",
    "content": "<a href='/docs/user/devops-pipelines/#devops-pipelines'>DevOps pipelines</a> can be set up to stage Node-RED instances that have different development stages such as test, development and production."
  },{
    "title": "Version History",
    "imageFolder": "./images/pictograms/",
    "imageFile": "snapshot_blue.png",
    "imageAlt": " snapshots.",
    "content": "<a href='/docs/user/snapshots/#snapshots'>Snapshots</a> of Node-RED instances can be taken to create a version history of the development work. Previous snapshot versions can be rolled back at any time."
  },{
    "title": "Team Collaboration",
    "imageFolder": "../images/pictograms/",
    "imageFile": "users_blue.png",
    "imageAlt": " a team.",
    "content": "Different development team members are able to share and develop on the same Node-RED instance making collaboration easier. <a href='/blog/2024/04/role-based-access-control-rbac-for-node-red-with-flowfuse'>Role based access control (RBAC)</a> allows for restrictions on what team members can access and do while using the FlowFuse platform."
  },{
    "title": "Built-in Security",
    "imageFolder": "../images/pictograms/",
    "imageFile": "security_pictogram_blue.png",
    "imageAlt": " a lock.",
    "content": "All Node-RED instances are accessed using TLS/SSL. Single Sign-on (SSO) allows for users to sign in to FlowFuse using an existing SAML identity provider and Audit logs keep track of all changes that occur to a Node-RED instance and which user was responsible for the change."
  },{
    "title": "Certified Nodes",
    "imageFolder": "../images/pictograms/",
    "imageFile": "certified-nodes_blue.png",
    "imageAlt": " certifying badge.",
    "content": "Our curated collection of certified nodes, ensuring top-notch quality, security, and support. Explore our certified nodes on the <a href='/certified-nodes'>Certified Nodes Page</a> and benefit from a robust ecosystem while maintaining operational reliability."
  }
]
